{
  "chunks": [
    {
      "text": "Maruf Rayhan\r\nTampere, Finland | (358) 041-3111797 | Email: maruf.rayhan14@gmail.com\r\nLinkedIn Profile: linkedin.com/in/md-maruf-rayhan | GitHub: github.com/MarufRayhan\r\nWebsite: www.marufrayhan.com\r\n\r\nPROFESSIONAL SUMMARY\r\nSoftware Developer with 4+ years of experience in modern web development. Strong expertise in\r\nReact, Python, Next.js, TypeScript, Node.js, and Cloud Services (AWS/Azure). Demonstrated ability\r\nto develop user-friendly applications and optimize performance across platforms.\r\n\r\nSKILLS\r\n●​ Programming Languages: JavaScript (4+ years), TypeScript (2+ years), Python (4+ years)\r\n●​ Frontend Development: React.js (3+ years), Redux (3+ years), Next.js (2+ years),\r\nCSS/SCSS (3+ years), UI/UX Design, Web Technologies, Figma\r\n●​ Backend Development: Node.js (3+ years), Express.js (2´+ years), FastAPI, RESTful APIs,\r\nSQLDatabases\r\n●​ Software Testing: Manual testing, Unit testing, Automated Testing,\r\n●​ Artificial Intelligence: LLM, Rag, Tensorflow, ´Keras, Matplotlib, Pandas\r\n●​ Cloud & DevOps: AWS (S3, Lambda), Docker, CI/CD\r\n●​ Additional Skills: Git, Atlassian Jira, Cross-Platform Development, Team Collaboration\r\n●​ Languages: English (Fluent, IELTS: 7)\r\n\r\nWORK EXPERIENCE\r\nFuture Automation Systems and Technologies Lab- FAST, Tampere, Finland\r\nFull Stack Software Developer and Researcher— 03/2024 - Present\r\n●​ Leading the development of an EU-funded collaborative education streaming data platform,\r\noverseeing partnerships with 25 global collaborators across 12 countries to establish a\r\ncentralized learning hub.\r\n●​ Architected and implemented a real-time learning management system\r\n(https://www.ai-prism.dev/) with scalable data pipelines using Next.js, TypeScript, and AWS\r\n(S3, Lambda). Designed streaming data workflows processing of educational content,\r\nimplemented Docker-based microservices for consistent deployment, and built REST APIs to\r\nensure data quality across development and production environments.\r\n●​ Successfully leading a team of 3 developers to integrate Large Language Models for\r\nautomated document generation and organization, streamlining the process of creating and\r\nmanaging documentation by 60%.\r\nGPT Lab, Tampere, Finland\r\nResearch Assistant — 06/2023 - 09/2023\r\n●​ Developed an innovative system for AI agent collaboration, establishing one of the first\r\nimplementations where AI agents work together on software engineering tasks.\r\n●​ Authored and collaborated on research with Austrian Post Group IT, introducing an\r\nAutonomous LLM-based Agent System (ALAS) that improved the quality of thousands of user\r\nstories across 6 agile teams, driving real-world adoption and operational efficiency.\r\n\r\n●​ Independently designed and developed the lab's website (gpt-lab.eu) from scratch, while\r\nimplementing comprehensive branding strategy across LinkedIn and X (Twitter) to establish\r\nGPT Lab's digital presence.\r\nTampere University, Tampere, Finland\r\nTeaching Assistant — 06/2023 - 12/2024\r\n●​ Mentored and guided 120+ computer science students every year in Software Design and\r\nRequirement Engineering course, assessing projects, and delivering detailed feedback on\r\narchitecture patterns, SOLID principles, design systems and requirements analysis.\r\nBJIT Limited, Dhaka, Bangladesh\r\nSoftware Engineer — 01/2019 - 07/2022\r\n●​ Developed and optimized multiple React.js applications including a restaurant management\r\nsystem, NFT marketplace, and CV sorting system\r\n●​ Managed internal project with efficient, maintainable, and scalable code\r\n●​ Implemented Node.js backend services with TypeScript for performance and type safety\r\n●​ Utilized Docker and CI/CD pipelines for streamlined deployment and testing\r\n●​ Led cross-functional collaboration and demonstrated strong communication skill as product\r\nowner for a Japanese NFT marketplace, coordinating with international stakeholders\r\n\r\nEducation\r\nTampere University, Tampere, Finland\r\nMSc in Software, Web and Cloud — 08/2022 - 12/2024\r\nThesis: Developing an AI-driven network suite: Leveraging LLMs for automated document\r\nprocessing and generation\r\nAmerican International University Bangladesh(AIUB), Dhaka, Bangladesh\r\nBSc in Computer Science and Engineering — 05/2014 - 02/2018\r\nCoursework: Data Structure (DS), Algorithm\r\n\r\nCERTIFICATIONS\r\n●​ Professional Scrum Master™ I (PSM I) (Issued by Scrum.org, December 16, 2021)\r\n\r\nAWARDS\r\n●​ Magna Cum Laude BSc Academic award based on criteria - Between CGPA 3.85 - 3.94 /4.00\r\n●​ DEAN’S LIST HONORS Two times AIUB Dean’s List and Dean’s Honorable Mention Award for\r\nsuccessfully earning a grade point average (GPA) 3.90/4.00.\r\n\r\nHOBBIES\r\nI like to play Fifa, plyaing soccer and learn more about Technologies\r\n\r\nPERSONAL LIFE\r\nI born and brought up in Rangpur, Bangladesh. My school was Rangpur Zilla school where I studeied my secondary certification.\r\nMy college was Rangpur Canotonment Public School and College, I had My Higher Secondary certification. In both my School\r\nand College I graduated with highest degree securing A+ in all the subjects. I am by born Muslim. My favorite player is \r\nLionel Messi. My dream is to be a CTO of any renowned company.",
      "metadata": {
        "source": "personal-info.txt"
      }
    }
  ]
}